website/app/Controllers/Tasks.php

    public function index()
    {
        $tasks = $this->taskModel->findAll();
---
SELECT *
FROM `task`